---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionRangesService
source: html/bcd433a3-c772-b992-a341-ce454bfabe0a.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionRangesService Property

The external service to view and modify structural connection ranges of applicability.

## Syntax (C#)
```csharp
public static ExternalServiceId ModifyConnectionRangesService { get; }
```